plugin_spec_version: v2
extension: plugin
products: [insightconnect]
name: rapid7_surface_command
title: Rapid7 Surface Command
description: Surface Command gives you full visibility over your assets and identities across multiple technology platforms
version: 1.2.0
version_history:
- 1.2.0 - Add new action | Tag Assets in Bulk
- 1.1.0 - Update action title | Add new action | Run Adhoc Query
- 1.0.0 - Initial plugin

supported_versions: [v1]
vendor: rapid7
support: rapid7
status: []
tags: [caasm, rapid7, surface_command, surface, command]
connection_version: 1
hub_tags:
  use_cases: [data_enrichment]
  keywords: [rapid7, cloud_enabled]
  features: []
resources:
  source_url: https://github.com/rapid7/insightconnect-plugins/tree/master/rapid7_surface_command
  license_url: https://github.com/rapid7/insightconnect-plugins/blob/master/LICENSE
  vendor_url: https://www.rapid7.com

key_features:
  - Query Surface Command Data

requirements:
  - User or Organization Key from the Insight Platform. To create one follow [Generate User API Key guide](https://docs.rapid7.com/insight/managing-platform-api-keys/#generating-a-user-key)
  - The Region where your Rapid7 Surface Command instance is hosted. To identify your region, see [Identify Data Region](https://docs.rapid7.com/insight/navigate-the-insight-platform/#check-your-data-region)
  - A valid Query ID (UUID) from Rapid7 Surface Command. To obtain a Query ID, edit a Saved Query in the Surface Command UI and retrieve its ID from the URL

troubleshooting: _This plugin does not contain any troubleshooting information._

cloud_ready: true
enable_cache: false

sdk:
  type: slim
  version: 6.4.3
  user: nobody

links:
  - "[Rapid7 Surface Command](https://www.rapid7.com/products/command/attack-surface-management-asm/)"

references:
  - '[Identify Data Region](https://docs.rapid7.com/insight/navigate-the-insight-platform/#check-your-data-region)'
  - '[Generate User API Key](https://docs.rapid7.com/insight/managing-platform-api-keys/#generating-a-user-key)'

connection:
  api_key:
    title: API Key
    description: User or Organization Key from the Insight Platform
    type: credential_secret_key
    example: a5zy0a6g-504e-46bz-84xx-1b3f5ci36l99
    required: true
  region:
    title: Region
    description: Region
    type: string
    default: us
    example: us
    required: true
    enum:
      # NOTE: these should match the values of the URL as per the docs at
      # https://docs.rapid7.com/insight/navigate-the-insight-platform/#check-your-data-region
      - us
      - us2
      - us3
      - eu
      - ca
      - au
      - ap

actions:
  run_query:
    title: Run a Saved Query
    description: Run and execute a saved query
    input:
      query_id:
        title: ID of Query to Run
        description: Query ID (UUID) to Run from Surface Command
        type: string
        required: true
        example: 12345678-1234-1234-1234-123456789012
    output:
      items:
        title: Items
        description: Array of Items
        type: "[]object"
        example: "[]"
        required: false
  run_adhoc_query:
    title: Run an Adhoc Query
    description: Run and execute an adhoc query
    input:
      cypher:
        title: Cypher Query to Execute
        description: Cypher query to execute
        type: string
        required: true
        example: "MATCH (m:Machine) RETURN m"
    output:
      items:
        title: Items
        description: Array of Items
        type: "[]object"
        example: "[]"
        required: false
  tag_assets:
    title: Tag Assets in Bulk
    description: Add, set, or remove tags on multiple assets in bulk using the Surface Command Graph API
    input:
      object_ids:
        title: Object IDs
        description: List of asset object IDs (UUIDs) to tag
        type: "[]string"
        required: true
        example: '["11111111-1111-1111-1111-111111111111", "22222222-2222-2222-2222-222222222222"]'
      tags:
        title: Tags
        description: List of tag values to apply
        type: "[]string"
        required: true
        example: '["env:prod", "team:security"]'
      operation:
        title: Operation
        description: "Tag operation to perform: add (append tags), set (replace all tags), or remove (delete tags)"
        type: string
        required: true
        example: add
        enum:
          - add
          - set
          - remove
    output:
      success_count:
        title: Success Count
        description: Number of assets successfully tagged
        type: integer
        example: 2
        required: true
      failure_count:
        title: Failure Count
        description: Number of assets that could not be tagged
        type: integer
        example: 0
        required: true
      failures:
        title: Failures
        description: Details of any tagging failures, including the object ID and error message
        type: "[]object"
        example: "[]"
        required: false
